# SQL Exercises

## Load the SQL extension and set the %%sql environment

In [1]:
%load_ext sql

%env DATABASE_URL=mysql+mysqlconnector://root:root_pwd@db

env: DATABASE_URL=mysql+mysqlconnector://root:root_pwd@db

## DDL - Data Definition Language

If we need to create a new database we run 

```mysql
CREATE DATABASE IF NOT EXISTS <DB NAME>;
```

Then, we need to tell SQL to interact with that specific database through

```mysql
USE <DB NAME>;
```

In [3]:
%%sql

CREATE DATABASE IF NOT EXISTS my_db;

USE my_db;

 * mysql+mysqlconnector://root:***@db
1 rows affected.
0 rows affected.

[]

The command 
```mysql 
SHOW TABLES;
``` 
allows us to see what tables are defined in the database.

In [4]:
%%sql

SHOW TABLES;

 * mysql+mysqlconnector://root:***@db
0 rows affected.

[]

To create a new table we need to run

```mysql
CREATE TABLE <TABLE NAME> (
    ATTRIBUTES TYPES CONSTRAINTS
);
```

In [6]:
%%sql

CREATE TABLE Users (
    UserID     varchar(30),
    BadgeNum   int(16),
    FirstName  varchar(255),
    LastName   varchar(255),
    Age        int,
    OtherAttr  float
);

SHOW TABLES;

 * mysql+mysqlconnector://root:***@db
0 rows affected.
1 rows affected.

[('Users',)]

To inspect the table schema we need to run the

```mysql
DESCRIBE <TABLE NAME>;
```
command.

In [7]:
%%sql

DESCRIBE Users;

 * mysql+mysqlconnector://root:***@db
6 rows affected.

[('UserID', b'varchar(30)', 'YES', '', None, ''),
 ('BadgeNum', b'int', 'YES', '', None, ''),
 ('FirstName', b'varchar(255)', 'YES', '', None, ''),
 ('LastName', b'varchar(255)', 'YES', '', None, ''),
 ('Age', b'int', 'YES', '', None, ''),
 ('OtherAttr', b'float', 'YES', '', None, '')]

To delete a table we simply run

```mysql
DROP TABLE IF EXISTS <TABLE NAME>;
```

In [8]:
%%sql

DROP TABLE IF EXISTS Users;

SHOW TABLES;

 * mysql+mysqlconnector://root:***@db
0 rows affected.
0 rows affected.

[]

### Products

Create a new `products` table with the following schema:

| Attribute | Type | Extra info | Constraint | 
| --- | --- | --- |--- |
| productID   | Integer | | NOT NULL AUTO_INCREMENT |
| productName | String | Max length 30 | DEFAULT "" |
| unitPrice   | Float | | NOT NULL DEFAULT 99999.99|
| unitsInStock | Integer | Unsigned | NOT NULL DEFAULT 0 |

`productID` will also be our `PRIMARY KEY`.

In [19]:
%%sql

CREATE TABLE IF NOT EXISTS products(
    productID     INT NOT NULL UNIQUE AUTO_INCREMENT PRIMARY KEY,
    productName   VARCHAR(30) DEFAULT "",
    unitPrice     FLOAT NOT NULL DEFAULT 99999.99,
    unitsInStock  INT UNSIGNED NOT NULL DEFAULT 0
);

SHOW TABLES;

 * mysql+mysqlconnector://root:***@db
0 rows affected.
1 rows affected.

[('products',)]

In [20]:
%%sql

DESCRIBE products;

 * mysql+mysqlconnector://root:***@db
4 rows affected.

[('productID', b'int', 'NO', 'PRI', None, 'auto_increment'),
 ('productName', b'varchar(30)', 'YES', '', b'', ''),
 ('unitPrice', b'float', 'NO', '', b'100000', ''),
 ('unitsInStock', b'int unsigned', 'NO', '', b'0', '')]

Now we want to alter the `products` table and add the `isDiscontinued` attribute following the procedure below: 

```mysql
ALTER TABLE <THE TABLE>
ADD COLUMN <NEW COL> <THE NEW ATTRIBUTE DECLARATION>;
```

In [21]:
%%sql

ALTER TABLE products
ADD COLUMN isDiscontinued BOOL NOT NULL;

DESCRIBE products;

 * mysql+mysqlconnector://root:***@db
0 rows affected.
5 rows affected.

[('productID', b'int', 'NO', 'PRI', None, 'auto_increment'),
 ('productName', b'varchar(30)', 'YES', '', b'', ''),
 ('unitPrice', b'float', 'NO', '', b'100000', ''),
 ('unitsInStock', b'int unsigned', 'NO', '', b'0', ''),
 ('isDiscontinued', b'tinyint(1)', 'NO', '', None, '')]

If we want to modify the default value we use 

```mysql
ALTER TABLE <THE TABLE>
ALTER <ATTRIBUTE> SET DEFAULT <NEW DEFAULT>;
```

In [22]:
%%sql

ALTER TABLE products
ALTER isDiscontinued SET DEFAULT 0;

DESCRIBE products;

 * mysql+mysqlconnector://root:***@db
0 rows affected.
5 rows affected.

[('productID', b'int', 'NO', 'PRI', None, 'auto_increment'),
 ('productName', b'varchar(30)', 'YES', '', b'', ''),
 ('unitPrice', b'float', 'NO', '', b'100000', ''),
 ('unitsInStock', b'int unsigned', 'NO', '', b'0', ''),
 ('isDiscontinued', b'tinyint(1)', 'NO', '', b'0', '')]

If instead we want to rename a column, change its datatype, or move it within the schema (e.g. change the `NOT NULL`, `AUTO_INCREMENT` etc.) we use

```mysql
ALTER TABLE <THE TABLE>
MODIFY <ATTRIBUTE> <ATTRIBUTE TYPE> <CONSTRAINT>;
```

In [23]:
%%sql

ALTER TABLE products
MODIFY productName VARCHAR(30) NOT NULL DEFAULT "";

DESCRIBE products;

 * mysql+mysqlconnector://root:***@db
0 rows affected.
5 rows affected.

[('productID', b'int', 'NO', 'PRI', None, 'auto_increment'),
 ('productName', b'varchar(30)', 'NO', '', b'', ''),
 ('unitPrice', b'float', 'NO', '', b'100000', ''),
 ('unitsInStock', b'int unsigned', 'NO', '', b'0', ''),
 ('isDiscontinued', b'tinyint(1)', 'NO', '', b'0', '')]

### Suppliers

Let's now create a `suppliers` table with the following description:

| Attribute | Type | Extra info | Constraint | 
| --- | --- | --- |--- |
| supplierID   | Integer | | NOT NULL AUTO_INCREMENT |
| supplierName | String | Max length 30 | NOT NULL DEFAULT "" |
| countryCode   | Char | Length 3 | NOT NULL |
| email   | String | Max length 30  | NOT NULL |

`supplierID` is going to act as the table's primary key in this case.

In [26]:
%%sql

CREATE TABLE IF NOT EXISTS suppliers (
    supplierID    INT NOT NULL AUTO_INCREMENT PRIMARY KEY,
    supplierName  VARCHAR(30) NOT NULL DEFAULT "",
    countryCode   CHAR(3) NOT NULL,
    email         VARCHAR(30) NOT NULL
);

SHOW TABLES;

 * mysql+mysqlconnector://root:***@db
0 rows affected.
2 rows affected.

[('products',), ('suppliers',)]

In [31]:
%%sql

DESCRIBE suppliers;

 * mysql+mysqlconnector://root:***@db
4 rows affected.

[('supplierID', b'int', 'NO', 'PRI', None, 'auto_increment'),
 ('supplierName', b'varchar(30)', 'NO', '', b'', ''),
 ('countryCode', b'char(3)', 'NO', '', None, ''),
 ('email', b'varchar(30)', 'NO', '', None, '')]

In [32]:
%%sql

ALTER TABLE suppliers
ALTER countryCode SET DEFAULT "ITA";

DESCRIBE suppliers;

 * mysql+mysqlconnector://root:***@db
0 rows affected.
4 rows affected.

[('supplierID', b'int', 'NO', 'PRI', None, 'auto_increment'),
 ('supplierName', b'varchar(30)', 'NO', '', b'', ''),
 ('countryCode', b'char(3)', 'NO', '', b'ITA', ''),
 ('email', b'varchar(30)', 'NO', '', None, '')]

### Relationship between Suppliers and Products

Create a new `supplier_to_product` table with the following attributes:
    
| Attribute | Type | Extra info | Constraint | 
| --- | --- | --- |--- |
| prodID   | Integer | | NOT NULL |
| supID    | Integer | | NOT NULL |

In [33]:
%%sql

CREATE TABLE IF NOT EXISTS supplier_to_product (
    prodID INT NOT NULL,
    supID  INT NOT NULL
);

SHOW TABLES;

 * mysql+mysqlconnector://root:***@db
0 rows affected.
3 rows affected.

[('products',), ('supplier_to_product',), ('suppliers',)]

In [34]:
%%sql 

DESCRIBE supplier_to_product;

 * mysql+mysqlconnector://root:***@db
2 rows affected.

[('prodID', b'int', 'NO', '', None, ''), ('supID', b'int', 'NO', '', None, '')]

Neither prodID nor supID is a good primary key in this case, as we can have both appearing multiple times in the table.

However, a good primary key for this table is the combination (prodID, supID) which is absolutely unique, and thus, a good key.

We can alter the table to add the primary key statement:
    
```mysql
ALTER TABLE <TABLE>
ADD PRIMARY KEY <ATTRIBUTE COMBINATION>;
```

In [35]:
%%sql

ALTER TABLE supplier_to_product
ADD PRIMARY KEY (prodID, supID);

DESCRIBE supplier_to_product;

 * mysql+mysqlconnector://root:***@db
0 rows affected.
2 rows affected.

[('prodID', b'int', 'NO', 'PRI', None, ''),
 ('supID', b'int', 'NO', 'PRI', None, '')]

Finally, we can link the 3 tables together by stating which attributes act as the foreign keys in the `supplier_to_product` table, and to which Attributes in the parent tables they refer to.

- `prodID` points to the `productID` attribute of `products` table
- `supID` points to the `supplierID` attribute of `supplier` table

```mysql
ALTER TABLE <TABLE>
ADD FOREIGN KEY (<ATTRIBUTE IN THIS TABLE>) REFERENCES <OTHER TABLE>(<ATTRIBUTE IN OTHER TABLE>);
```

In [36]:
%%sql

ALTER TABLE supplier_to_product
ADD FOREIGN KEY (prodID) REFERENCES products (productID);

ALTER TABLE supplier_to_product
ADD FOREIGN KEY (supID) REFERENCES suppliers (supplierID);

 * mysql+mysqlconnector://root:***@db
0 rows affected.
0 rows affected.

[]

## DML - Data Manipulation Language

Verify that the product table is actually empty using 

```mysql
SELECT * FROM <TABLE>;
```

In [37]:
%%sql

SELECT * FROM products;

 * mysql+mysqlconnector://root:***@db
0 rows affected.

[]

Insert products in the `products` table using

```mysql
INSERT INTO <TABLE> (<COLUMN1>, <COLUMN2>, <COLUMN3>, ...)
VALUES (<VALUE1>, <VALUE2>, <VALUE3>, ...);
```

In [72]:
%%sql

INSERT INTO products (
    productName, unitPrice, unitsInStock, isDiscontinued
)
VALUES 
("Founders Porter", 4.9, 12,  0),
("Punk IPA",        5.2, 45,  0),
("HB Dunkel",       4.5, 250, 0),
("Forst Xmas",      8.0, 2,   0),
("Damm Complot",    3.7, 120, 0);

SELECT * FROM products;

 * mysql+mysqlconnector://root:***@db
5 rows affected.
5 rows affected.

[(1, 'Founders Porter', 4.9, 12, 0),
 (2, 'Punk IPA', 5.2, 45, 0),
 (3, 'HB Dunkel', 4.5, 250, 0),
 (4, 'Forst Xmas', 8.0, 2, 0),
 (5, 'Damm Complot', 3.7, 120, 0)]

We can update a record using


```mysql
UPDATE <TABLE>
SET <ATTRIBUTE> = <NEW VALUE>
WHERE <CONDITION>;
```

In [73]:
%%sql

UPDATE products
SET isDiscontinued = 1
WHERE productName = "HB Dunkel";

SELECT * FROM products;

 * mysql+mysqlconnector://root:***@db
1 rows affected.
5 rows affected.

[(1, 'Founders Porter', 4.9, 12, 0),
 (2, 'Punk IPA', 5.2, 45, 0),
 (3, 'HB Dunkel', 4.5, 250, 1),
 (4, 'Forst Xmas', 8.0, 2, 0),
 (5, 'Damm Complot', 3.7, 120, 0)]

We can delete an entire row using


```mysql
DELETE FROM <TABLE>
WHERE <CONDITION>;
```

In [74]:
%%sql

DELETE FROM products
WHERE (productName LIKE "F%s");

SELECT * FROM products;

 * mysql+mysqlconnector://root:***@db
1 rows affected.
4 rows affected.

[(1, 'Founders Porter', 4.9, 12, 0),
 (2, 'Punk IPA', 5.2, 45, 0),
 (3, 'HB Dunkel', 4.5, 250, 1),
 (5, 'Damm Complot', 3.7, 120, 0)]

In [66]:
%%sql

INSERT INTO suppliers (
    supplierName, countryCode, email
)
VALUES 
("A hop in the park",       "USA", "contactme@ahop.com"),
("Allez Hops! Cave à bièr", "FRA", "itsme@allezhops.com"),
("Wild Hops",               "ITA", "myemail@wildhops.it"),
("Beer Paradise",           "ITA", "beer@beerparadise.it");


SELECT * FROM suppliers;

 * mysql+mysqlconnector://root:***@db
4 rows affected.
4 rows affected.

[(1, 'A hop in the park', 'USA', 'contactme@ahop.com'),
 (2, 'Allez Hops! Cave à bièr', 'FRA', 'itsme@allezhops.com'),
 (3, 'Wild Hops', 'ITA', 'myemail@wildhops.it'),
 (4, 'Beer Paradise', 'ITA', 'beer@beerparadise.it')]

In [75]:
%%sql

UPDATE suppliers
SET email = "anewemail@ahop.com"
WHERE supplierName = "A hop in the park";

SELECT * FROM suppliers;

 * mysql+mysqlconnector://root:***@db
1 rows affected.
4 rows affected.

[(1, 'A hop in the park', 'USA', 'anewemail@ahop.com'),
 (2, 'Allez Hops! Cave à bièr', 'FRA', 'itsme@allezhops.com'),
 (3, 'Wild Hops', 'ITA', 'myemail@wildhops.it'),
 (4, 'Beer Paradise', 'ITA', 'beer@beerparadise.it')]

Now we want to populate the relationship table that connects suppliers and products.

In [76]:
%%sql

INSERT INTO supplier_to_product (supID, prodID)
VALUES
(1, 2),
(1, 3);

SELECT * FROM supplier_to_product;

 * mysql+mysqlconnector://root:***@db
2 rows affected.
2 rows affected.

[(2, 1), (3, 1)]

## Basic Queries

In [77]:
%%sql

SELECT email 
FROM suppliers
WHERE countryCode = "ITA";

 * mysql+mysqlconnector://root:***@db
2 rows affected.

[('myemail@wildhops.it',), ('beer@beerparadise.it',)]

In [78]:
%%sql

SELECT * 
FROM products 
WHERE unitPrice > 4;

 * mysql+mysqlconnector://root:***@db
3 rows affected.

[(1, 'Founders Porter', 4.9, 12, 0),
 (2, 'Punk IPA', 5.2, 45, 0),
 (3, 'HB Dunkel', 4.5, 250, 1)]

In [79]:
%%sql

SELECT *
FROM products
WHERE unitPrice < 5
ORDER BY unitsInStock DESC;

 * mysql+mysqlconnector://root:***@db
3 rows affected.

[(3, 'HB Dunkel', 4.5, 250, 1),
 (5, 'Damm Complot', 3.7, 120, 0),
 (1, 'Founders Porter', 4.9, 12, 0)]

In [80]:
%%sql

SELECT countryCode, COUNT(countryCode) AS count
FROM suppliers
GROUP BY countryCode;

 * mysql+mysqlconnector://root:***@db
3 rows affected.

[('USA', 1), ('FRA', 1), ('ITA', 2)]

In [82]:
%%sql

SELECT * 
FROM suppliers s, supplier_to_product sp
WHERE s.supplierID = sp.supID;

 * mysql+mysqlconnector://root:***@db
2 rows affected.

[(1, 'A hop in the park', 'USA', 'anewemail@ahop.com', 2, 1),
 (1, 'A hop in the park', 'USA', 'anewemail@ahop.com', 3, 1)]

In [83]:
%%sql

SELECT * 
FROM suppliers s
INNER JOIN supplier_to_product sp
ON s.supplierID = sp.supID;

 * mysql+mysqlconnector://root:***@db
2 rows affected.

[(1, 'A hop in the park', 'USA', 'anewemail@ahop.com', 2, 1),
 (1, 'A hop in the park', 'USA', 'anewemail@ahop.com', 3, 1)]

In [90]:
%%sql

SELECT *
FROM supplier_to_product sp
INNER JOIN suppliers s
ON s.supplierID = sp.supID
INNER JOIN products p
ON p.productID = sp.prodID

 * mysql+mysqlconnector://root:***@db
2 rows affected.

[(2, 1, 1, 'A hop in the park', 'USA', 'anewemail@ahop.com', 2, 'Punk IPA', 5.2, 45, 0),
 (3, 1, 1, 'A hop in the park', 'USA', 'anewemail@ahop.com', 3, 'HB Dunkel', 4.5, 250, 1)]

In [91]:
%%sql

INSERT INTO supplier_to_product (supID, prodID)
VALUES
(3,1),
(3,2),
(3,3),
(3,5),
(4,2),
(4,5),
(2,1),
(2,3);

SELECT * FROM supplier_to_product;

 * mysql+mysqlconnector://root:***@db
8 rows affected.
10 rows affected.

[(2, 1),
 (3, 1),
 (1, 2),
 (3, 2),
 (1, 3),
 (2, 3),
 (3, 3),
 (5, 3),
 (2, 4),
 (5, 4)]

In [101]:
%%sql

SELECT s.supplierName, s.countryCode, p.productName
FROM supplier_to_product sp
INNER JOIN suppliers s
ON s.supplierID = sp.supID
INNER JOIN products p
ON p.productID = sp.prodID;

 * mysql+mysqlconnector://root:***@db
10 rows affected.

[('A hop in the park', 'USA', 'Punk IPA'),
 ('A hop in the park', 'USA', 'HB Dunkel'),
 ('Allez Hops! Cave à bièr', 'FRA', 'Founders Porter'),
 ('Allez Hops! Cave à bièr', 'FRA', 'HB Dunkel'),
 ('Wild Hops', 'ITA', 'Founders Porter'),
 ('Wild Hops', 'ITA', 'Punk IPA'),
 ('Wild Hops', 'ITA', 'HB Dunkel'),
 ('Wild Hops', 'ITA', 'Damm Complot'),
 ('Beer Paradise', 'ITA', 'Punk IPA'),
 ('Beer Paradise', 'ITA', 'Damm Complot')]

In [96]:
%%sql

SELECT s.*
FROM supplier_to_product sp
INNER JOIN suppliers s
ON s.supplierID = sp.supID
INNER JOIN products p
ON p.productID = sp.prodID
WHERE p.productName = "Damm Complot";

 * mysql+mysqlconnector://root:***@db
2 rows affected.

[(3, 'Wild Hops', 'ITA', 'myemail@wildhops.it'),
 (4, 'Beer Paradise', 'ITA', 'beer@beerparadise.it')]

In [97]:
%%sql

SELECT s.email
FROM supplier_to_product sp
INNER JOIN suppliers s
ON s.supplierID = sp.supID
INNER JOIN products p
ON p.productID = sp.prodID
WHERE p.productName = "Punk IPA";

 * mysql+mysqlconnector://root:***@db
3 rows affected.

[('anewemail@ahop.com',), ('myemail@wildhops.it',), ('beer@beerparadise.it',)]

In [102]:
%%sql

SELECT s.supplierName, p.productName, p.unitPrice
FROM supplier_to_product sp
INNER JOIN suppliers s
ON s.supplierID = sp.supID
INNER JOIN products p
ON p.productID = sp.prodID
WHERE s.countryCode = "ITA"
ORDER BY p.unitPrice DESC;

 * mysql+mysqlconnector://root:***@db
6 rows affected.

[('Wild Hops', 'Punk IPA', 5.2),
 ('Beer Paradise', 'Punk IPA', 5.2),
 ('Wild Hops', 'Founders Porter', 4.9),
 ('Wild Hops', 'HB Dunkel', 4.5),
 ('Wild Hops', 'Damm Complot', 3.7),
 ('Beer Paradise', 'Damm Complot', 3.7)]